src/cf/InformationRegisters/НоменклатураМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураМаркетплейсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НоменклатураМаркетплейсов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИдентификаторМаркетплейса(Номенклатура, Маркетплейс, ИдентификаторМаркетплейса) Экспорт
	
	Если НЕ (ЗначениеЗаполнено(ИдентификаторМаркетплейса)
		И ЗначениеЗаполнено(Маркетплейс)) Тогда
		Возврат;
	КонецЕсли;

	МенеджерЗаписи              = РегистрыСведений.НоменклатураМаркетплейсов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Маркетплейс  = Маркетплейс;
	МенеджерЗаписи.ИдентификаторТовара = ИдентификаторМаркетплейса;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
